app/controllers/categories_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def edit
    if current_user.type=="Master"
    @category=Category.find(params[:id])

INSERT INTO `categories` (`categories`, `description`, `updated_at`, `created_at`) VALUES('jeans', 'latest jeans of different brands', '2012-09-29 11:36:40', '2012-09-29 11:36:40')
---
  def create
    if current_user.type=="Master"
     @category=Category.new(params[:category])
     if @category.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
---
  def update
    if current_user.type=="Master"
    @category=Category.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 1)
DELETE FROM `categories` WHERE `id` = 1
---
  def destroy
    @category=Category.find(params[:id])
    @category.destroy

SELECT * FROM `users` WHERE (`users`.`type` = 'Employee')
---
  def employee_list
    @employee=User.find_all_by_type("Employee")