app/controllers/commodities_controller.rb

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
---
  def index
		 @category = Category.find(params[:category_id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
---
  def new
    if current_user.type=="Master"
     @category = Category.find(params[:category_id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
SELECT * FROM `commodities` WHERE (`commodities`.`id` = 1 AND (`commodities`.category_id = 3))
---
  def edit
    if current_user.type=="Master"
    @category = Category.find(params[:category_id])
    @commodity = @category.commodities.find(params[:id])

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
INSERT INTO `commodities` (`created_at`, `updated_at`, `category_id`, `description`, `commodity`) VALUES('2012-10-01 09:20:12', '2012-10-01 09:20:12', 2, 'Rs:1000\r\n', 'peppe')
---
  def create
    if current_user.type=="Master"
    @category = Category.find(params[:category_id])
    @commodity = @category.commodities.build(params[:commodity])
    #@intake=params[:commodity][:intake_amt]
    if @commodity.save

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
SELECT * FROM `commodities` WHERE (`commodities`.`id` = 1)
UPDATE `commodities` SET `description` = 'Rs:1000\r\n333', `updated_at` = '2012-10-03 04:17:06' WHERE `id` = 4
---
   def update
     if current_user.type=="Master"
     @category = Category.find(params[:category_id])
     @commodity = Commodity.find(params[:id])
     if @commodity.update_attributes(params[:commodity])

SELECT * FROM `categories` WHERE (`categories`.`id` = 3)
SELECT * FROM `commodities` WHERE (`commodities`.`id` = 1)
DELETE FROM `commodities` WHERE `id` = 1
---
   def destroy
      @category = Category.find(params[:category_id])
      @commodity = Commodity.find(params[:id])
      @commodity.destroy

SELECT * FROM `outflows` WHERE (`outflows`.`user_id` = 1)
---
   def employee_details

     @outflows=Outflow.find_all_by_user_id(current_user)

SELECT * FROM `intakes` WHERE (created_at >= '2012-10-04' AND created_at <= '2012-10-04')
SELECT * FROM `outflows` WHERE (created_at >= '2012-10-04' AND created_at <= '2012-10-04')
---
   def admin_report
      @intake_reports=Intake.find(:all)
      @outflow_reports=Outflow.find(:all)

SELECT * FROM `outflows` WHERE (`outflows`.`user_id` = 2)
---
   def employee_report
     @outflow_reports=Outflow.find_all_by_user_id(current_user)

SELECT * FROM `intakes` WHERE (`intakes`.`commodity_id` IS NULL)
SELECT * FROM `outflows` WHERE (`outflows`.`commodity_id` IS NULL)
---
   def commodity_details
     commodity_id = params[:report][:commodity_id]
     @intakes=Intake.find_all_by_commodity_id(commodity_id)
     @outflows=Outflow.find_all_by_commodity_id(commodity_id)