app/controllers/intakes_controller.rb

SELECT * FROM `commodities` WHERE (`commodities`.`id` = 16)
---
  def intake
    @commodity=Commodity.find(params[:commodity_id])

SELECT * FROM `commodities` WHERE (`commodities`.`id` = 16)
INSERT INTO `intakes` (`updated_at`, `created_at`, `user_id`, `commodity_id`, `intake_amt`) VALUES('2012-10-08 07:01:30', '2012-10-08 07:01:30', 1, 1, 5000.0)
---
  def create
    if current_user.type=="Master"
      @commodity=Commodity.find(params[:commodity_id])
      @intake=@commodity.intakes.build(params[:intake])
      @intake.user_id=current_user.id
      if @intake.save