app/controllers/outflows_controller.rb

SELECT * FROM `commodities` WHERE (`commodities`.`id` = 16)
---
  def outflow
    @commodity=Commodity.find(params[:commodity_id])

SELECT * FROM `commodities` WHERE (`commodities`.`id` = 16)
SELECT * FROM `intakes` WHERE (`intakes`.`commodity_id` = 20)
SELECT * FROM `outflows` WHERE (`outflows`.`commodity_id` = 1)
INSERT INTO `outflows` (`updated_at`, `outflow_amt`, `commodity_id`, `created_at`, `user_id`) VALUES('2012-10-03 07:07:33', 100.0, 16, '2012-10-03 07:07:33', 1)
---
  def create
      @commodity=Commodity.find(params[:commodity_id])
      @outflow=@commodity.outflows.build(params[:outflow])
      @intake=Intake.find_all_by_commodity_id(@commodity.id).sum(&:intake_amt).to_f
      @outfl=Outflow.find_all_by_commodity_id(@commodity.id).sum(&:outflow_amt).to_f
      @out_amt=params[:outflow][:outflow_amt].to_f
      @out=@outfl+@out_amt
      @out.to_f
      @outflow.user_id=current_user.id
      if @intake > @out
      if @outflow.save