app/controllers/users_controller.rb

INSERT INTO `users` (`persistence_token`, `created_at`, `password_salt`, `email`, `crypted_password`, `updated_at`, `username`, `type`) VALUES('b9ed584d2561fe035107296f629d9fdcd304c1fbeb6f95ff651a6f7aa3608b06d6267c3bcc5387e6381fd27c114e76c5f6c11843c2c6eaaed3808d0ea046fa89', '2012-10-04 04:22:55', 'FJmyXYBgDT90GZbtkKmf', 'jithin@foradian.com', '07fb54aed6105297426d7730b9bb4cf5acca0fa24e474f3299a0cb2cc6aa63ed7a48440bf324c9bcbbcf1b14412bc408a24dd13a348ee8560f6a00a0ce04041c', '2012-10-04 04:22:55', 'jithin', 'Employee')
---
  def create
	    @user = Employee.new(params[:user])
            @name=params[:user][:username]
            @user.password=@name+"123"
            @user.password_confirmation=@name+"123"
	    if @user.save

UPDATE `users` SET `password_salt` = 'zvTNvhzXTmYJLvvHdTnN', `persistence_token` = '39e83aea77220a4bc1b5e26be7af8785e563ce03c1892b295938164aa31a97629cd6dbe6dca489914aaf087bc2be60628a5322bd6708e2bbf3a4105743e1e4df', `crypted_password` = 'b27a2b010cf7f8f76c7922e4ecbb21c0f3bc4ed509d19ff258886efb9dc5e6dc8e4dfabf1697a62bc7271561b019fcc051fba913802aba33f91ce1124fc5b9a2', `updated_at` = '2012-09-29 10:31:43' WHERE `id` = 1
---
    def update
	    @user=current_user
	    if @user.update_attributes(params[:user])